---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.Events.TaskDialogShowingEventArgs
source: html/ddbaa6a8-4626-2b24-6c2d-8b8b06379ca1.htm
---
# TaskDialogShowingEventArgs Members

When the event is cancellable, may call the Cancel() method to cancel it.